In [1]:
import numpy as np
import pandas as pd

In [3]:
a = np.array([[1,2,3,4],[5,6,7,8]])

In [26]:
dict1 = {
    "name": ["Chinmay","DoIT","NeverGiveUP","ican"],
    "marks": [99, 98, 100, 1000],
    "city": ["dpr", "aura", "eathOn","mars"]
    
}

In [27]:
df = pd.DataFrame(dict1)

In [28]:
df

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [29]:
df.to_csv('friends.csv')

In [30]:
df.to_csv('friends_index_false.csv', index="false")

In [31]:
df.head()

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars

In [32]:
df.tail()

          name  marks    city
0      Chinmay     99     dpr
1         DoIT     98    aura
2  NeverGiveUP    100  eathOn
3         ican   1000    mars